soap-samples/parallelogram-request.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:shape="http://wuniversity.edu/se/shapetool">
   <soapenv:Header/>
   <soapenv:Body>
      <shape:ParallelogramAreaRequest>
         <shape:base>12.0</shape:base>
         <shape:height>6.0</shape:height>
      </shape:ParallelogramAreaRequest>
   </soapenv:Body>
</soapenv:Envelope>